IDEA Open Model
HingeElement1D.HingeTypeRX Property
Compatible with IDEA StatiCa 20.1
 Hinge type in dirrection round X
 Namespace: IdeaRS.OpenModel.Model
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.1.0
Syntax
public HingeTypeInDirrection HingeTypeRX { get; set; }
Public Property HingeTypeRX As HingeTypeInDirrection
	Get
	Set
Property Value
Type: HingeTypeInDirrection
See Also
Reference
HingeElement1D Class
IdeaRS.OpenModel.Model Namespace